In [14]:
import pandas as pd

In [15]:
#uyarı mesajlarını kapatmak için kodun en başına yaz
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv("outlier_ornek_veriseti.csv", sep=';')
df

      isim  boy
0      can   88
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150
13    veli  207
14   ilker  234

In [3]:
# aykırı değer 
# percentile hesaplama:
#veri setini küçükten büyüğe diz,ortadaki değer medyan yani Q2 bulduktan sonra
#verinin çeyreğindeki değer Q1
#bizde q1 138,q2 144, q3 149 ve,
# IQR değeri = Q3-Q1 = 149-138= 11
#alt_limit= Q1-1.5*IQR =121,5
#ust_limit=Q3+1.5*IQR =165,5

In [4]:
df.describe()

              boy
count   15.000000
mean   149.466667
std     32.943386
min     88.000000
25%    138.000000
50%    144.000000
75%    149.000000
max    234.000000

In [5]:
Q1= df.boy.quantile(0.25)
Q1

138.0

In [6]:
Q3= df.boy.quantile(0.75)
Q3

149.0

In [7]:
IQR_degeri= Q3-Q1
IQR_degeri

11.0

In [8]:
alt_limit = Q1 - 1.5*IQR_degeri
alt_limit

121.5

In [9]:
ust_limit = Q3 + 1.5*IQR_degeri

In [10]:
ust_limit

165.5

In [11]:
df[(df.boy < alt_limit) | (df.boy > ust_limit)]

     isim  boy
0     can   88
13   veli  207
14  ilker  234

In [12]:
#outlier değerlerinin verisetinden çıkarılması
df_outlier_filtrelenmis = df[(df.boy > alt_limit) & (df.boy < ust_limit)]
df_outlier_filtrelenmis

      isim  boy
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150